mockterview/rails/app/controllers/appointments_controller.rb

SELECT "appointments".* FROM "appointments"
---
def index
  appointments = Appointment.all

SELECT  "appointments".* FROM "appointments" WHERE "appointments"."id" = ? LIMIT 1  [["id", 4]]
---
def show
  appointment = Appointment.find(params[:id])

INSERT INTO "appointments" ("user_id", "interviewer_id", "further_details", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 34], ["interviewer_id", -1], ["further_details", ""], ["created_at", "2017-06-21 21:05:30.490183"], ["updated_at", "2017-06-21 21:05:30.490183"]]
---
def create

  new_appointment = Appointment.create!({
    time: params[:time],
    user_id: current_user.id,
    User_username: current_user.username,
    InterviewerName: params[:InterviewerName],
    interviewer_id: params[:interviewer_id],
    further_details: params[:further_details]
    })

SELECT  "appointments".* FROM "appointments" WHERE "appointments"."id" = ? LIMIT 1  [["id", 0]]
DELETE FROM "appointments" WHERE "appointments"."id" = ?  [["id", 8]]
---
def destroy
  appointment = Appointment.find(params[:id])

  if(appointment.destroy!)