mockterview/rails/app/controllers/interviewers_controller.rb

  def index
    interviewers = Interviewer.all
---
SELECT "interviewers".* FROM "interviewers"

  def show
    interviewer = Interviewer.find(params[:id])
---
SELECT  "interviewers".* FROM "interviewers" WHERE "interviewers"."id" = ? LIMIT 1  [["id", 1]]