mockterview/rails/app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("rating", "user_id", "interviewer_id", "personal_review", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["rating", 3], ["user_id", 29], ["interviewer_id", 21], ["personal_review", "bla bla"], ["created_at", "2017-06-21 14:44:06.796208"], ["updated_at", "2017-06-21 14:44:06.796208"]]
---
  def create
    new_review = Review.create!({
      rating: params[:rating],
      user_id: current_user.id,
      interviewer_id: params[:interviewer_id],
      personal_review: params[:personal_review]
      })